#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

terraform
google_bigquery_dataset.social_dataset: Refreshing state... [id=projects/ml-project-210100/datasets/social_dataset]
google_service_account.pubsub_social_dashboard: Refreshing state... [id=projects/ml-project-210100/serviceAccounts/pubsub-social-dashboard@ml-project-210100.iam.gserviceaccount.com]
google_data_catalog_entry_group.social_data: Refreshing state... [id=projects/ml-project-210100/locations/asia-northeast1/entryGroups/social_data]
google_pubsub_topic.jasso_gakuseiseikatsu_stats_importer: Refreshing state... [id=projects/ml-project-210100/topics/jasso-gakuseiseikatsu-stats-importer]
module.runner["jasso-gakuseiseikatsu-stats-importer"].google_cloud_run_service.main: Refreshing state... [id=locations/asia-northeast1/namespaces/ml-project-210100/services/jasso-gakuseiseikatsu-stats-importer]
google_pubsub_topic.jasso_gakuseiseikatsu_stats_importer_dl: Refreshing state... [id=projects/ml-project-210100/topics/jasso-gakuseiseikatsu-stats-importer-dl]
google_data_catalog_tag_template.data_ingestion: Refreshing state... [id=projects/ml-project-210100/locations/asia-northeast1/tagTemplates/data_ingestion]
google_pubsub_subscription.jasso_gakuseiseikatsu_stats_importer_dl: Refreshing state... [id=projects/ml-project-210100/subscriptions/jasso-gakuseiseikatsu-stats-importer-dl]
google_pubsub_subscription.jasso_gakuseiseikatsu_stats_importer: Refreshing state... [id=projects/ml-project-210100/subscriptions/jasso-gakuseiseikatsu-stats-importer]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_pubsub_subscription.e_stat_importer will be created
  + resource "google_pubsub_subscription" "e_stat_importer" {
      + ack_deadline_seconds       = 10
      + enable_message_ordering    = false
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "e-stat-importer"
      + path                       = (known after apply)
      + project                    = (known after apply)
      + retain_acked_messages      = false
      + topic                      = (known after apply)

      + dead_letter_policy {
          + dead_letter_topic     = (known after apply)
          + max_delivery_attempts = 5
        }

      + expiration_policy {
          + ttl = "2678400s"
        }

      + push_config {
          + push_endpoint = (known after apply)

          + oidc_token {
              + service_account_email = "pubsub-social-dashboard@ml-project-210100.iam.gserviceaccount.com"
            }
        }

      + retry_policy {
          + maximum_backoff = "600s"
          + minimum_backoff = "10s"
        }

      + timeouts {}
    }

  # google_pubsub_subscription.e_stat_importer_dl will be created
  + resource "google_pubsub_subscription" "e_stat_importer_dl" {
      + ack_deadline_seconds       = 10
      + enable_message_ordering    = false
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "e-stat-importer-dl"
      + path                       = (known after apply)
      + project                    = (known after apply)
      + retain_acked_messages      = false
      + topic                      = (known after apply)

      + expiration_policy {
          + ttl = "2678400s"
        }

      + timeouts {}
    }

  # google_pubsub_topic.e_stat_importer will be created
  + resource "google_pubsub_topic" "e_stat_importer" {
      + id      = (known after apply)
      + name    = "e-stat-importer"
      + project = (known after apply)

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # google_pubsub_topic.e_stat_importer_dl will be created
  + resource "google_pubsub_topic" "e_stat_importer_dl" {
      + id      = (known after apply)
      + name    = "e-stat-importer-dl"
      + project = (known after apply)

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # module.runner["e-stat-importer"].google_cloud_run_service.main will be created
  + resource "google_cloud_run_service" "main" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "asia-northeast1"
      + name                       = "e-stat-importer"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = {
              + "run.googleapis.com/ingress"        = "internal-and-cloud-load-balancing"
              + "run.googleapis.com/ingress-status" = "internal-and-cloud-load-balancing"
            }
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = {
                  + "autoscaling.knative.dev/maxScale" = "10"
                }
              + generation       = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = 1
              + serving_state         = (known after apply)
              + timeout_seconds       = 3600

              + containers {
                  + args    = []
                  + command = []
                  + image   = "us-docker.pkg.dev/cloudrun/container/hello"

                  + ports {
                      + container_port = 8080
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1000m"
                          + "memory" = "512Mi"
                        }
                    }
                }
            }
        }

      + timeouts {}

      + traffic {
          + latest_revision = true
          + percent         = 100
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>